[
  {
    "title": "Steak With Blue Cheese Sherry Sauce",
    "source_url": "https://www.foodista.com/recipe/J8RVH7KB/steak-with-blue-cheese-sherry-sauce",
    "ready_in_minutes": 45,
    "servings": 2,
    "image": "https://img.spoonacular.com/recipes/661522-556x370.jpg",
    "instructions": "<ol><li>Prepare the Steaks:</li><li>Cut steak in half. With a meat tenderizer or textured mallet pound steaks to about 1/4-inch thick. Set aside and make the sauce before grilling.</li><li>Prepare the Sauce:</li><li>Combine Sherry and oil in a small sauce pan. Bring to a boil and cook until the alcohol has burned off.</li><li>Reduce heat to a low simmer and add the blue cheese; whisk until creamy. Remove from heat and grill steaks.</li><li>Grill Steaks:</li><li>Brush steaks with olive oil and grill 1 minute - 90 seconds on each side.</li><li>Warm up sauce and add chopped parsley. Pour sauce over steaks and serve.</li></ol>",
    "ingredients": [
      "3 tablespoons blue cheese crumbles",
      "2 tablespoons Olive Oil, plus extra for brushing steaks",
      "2 teaspoons parsley, finely chopped",
      "2 tablespoons Sherry (inexpensive cooking Sherry is okay!)",
      "2/3 pound top round"
    ]
  },
  {
    "title": "Barbecued Lamb Chops",
    "source_url": "http://www.foodista.com/recipe/LVCWJZNW/barbecued-lamb-chops",
    "ready_in_minutes": 45,
    "servings": 1,
    "image": "https://img.spoonacular.com/recipes/634309-556x370.jpg",
    "instructions": "<ol><li>Place the lamb chops in a covered casserole and cover with the rest of the ingredients.</li><li>Let sit refrigerated overnight. Barbecue the lamb chops [ Charred rare] on a charcoal grill. [No hickory or mesquite] Save the marinade mixture and cook</li><li>In abulghour (bulgur) pilaf* which would be an excellent side dish.</li></ol>",
    "ingredients": [
      "1 teaspoon fresh basil leaves, chopped",
      "1 teaspoon fresh mint leaves, chopped",
      "1 green bell pepper, chopped",
      "8 loin lamb chops 1-1 1/2 inches thick",
      "1/2 cup red wine",
      "salt and pepper to taste",
      "1 yellow onion, chopped",
      "1/4 cup Armenian or Italian parsley, chopped"
    ]
  },
  {
    "title": "Brown Sugar and Balsamic Glazed Pork Loin",
    "source_url": "https://www.foodista.com/recipe/R3TYDR87/brown-sugar-and-balsamic-glazed-pork-loin",
    "ready_in_minutes": 45,
    "servings": 6,
    "image": "https://img.spoonacular.com/recipes/636301-556x370.jpg",
    "instructions": "Combine sage, salt, pepper and garlic. Rub over roast. Place in slow cooker with 1/2 cup water. Cook on low for 6-8 hours. About 1 hour before roast is done, combine ingredients for glaze in small sauce pan. Heat and stir until mixture thickens. Brush roast with glaze 2 or 3 times during the last hour of cooking. Serve with remaining glaze on the side.",
    "ingredients": [
      "1 (2 pound) boneless pork loin",
      "1 teaspoon ground sage",
      "1/2 teaspoon salt",
      "1/4 teaspoon pepper",
      "1 clove garlic, crushed",
      "1/2 cup water",
      "Glaze",
      "1/2 cup brown sugar",
      "1 tablespoon cornstarch",
      "1/4 cup balsamic vinegar",
      "2 tablespoons soy sauce"
    ]
  },
  {
    "title": "Pork Carnitas Tacos",
    "source_url": "https://www.foodista.com/recipe/76ZPMZJN/pork-carnitas-tacos",
    "ready_in_minutes": 45,
    "servings": 8,
    "image": "https://img.spoonacular.com/recipes/656723-556x370.jpg",
    "instructions": "In a large Dutch oven add the pork, garlic, salt and pepper, and water. Bring to a boil, then reduce heat, cover and simmer over medium low for 45 minutes to one hour. Drain well.\nWhen cool enough to handle, shred the meat by hand or with the tines of a fork. Remove and discard any remaining fat. Transfer back to Dutch oven and heat the olive oil. Add the orange juice and milk and cook until liquid has evaporated and pork has browned; stirring occasionally. Season with salt and pepper to taste.\n\n \nChop onions and cilantro, and slice avocado and limes. Place each in small individual bowls for serving. \n\nHeat tortillas in a dry frying pan and keep warm.\nFor each taco, stack 2 tortillas and layer with warm carnitas, chopped cilantro, onion and avocado slices and give it a good squeeze of lemon juice.",
    "ingredients": [
      "7 cups water",
      "2 pounds Pork butt trimmed, and cut in 2\" cubes",
      "4 cloves garlic, crushed",
      "sea salt and ground pepper to taste",
      "1 teaspoon olive oil",
      "1/2 cup orange juice",
      "1/2 cup milk",
      "24 Corn Tortillas",
      "Salsa Fresca",
      "Avocado slices",
      "Chopped cilantro",
      "Chopped onion",
      "Limes cut into wedges"
    ]
  },
  {
    "title": "Aromatic perch fillets",
    "source_url": "https://www.foodista.com/recipe/5H3DPRV6/aromatic-perch-fillets",
    "ready_in_minutes": 45,
    "servings": 3,
    "image": "https://img.spoonacular.com/recipes/632726-556x370.jpg",
    "instructions": "<ol><li>Mix flour and corn flour, salt and pepper.</li><li>Prepare the seasoning mix: finely grind all the spices (in a coffee mill, for example). Since you do not need the whole quantity, store the mix in an airtight glass bottle and refrigerate for future use.</li><li>Add the seasoning to flour mixture, stir.</li><li>Slowly add beer, whisking constantly until a batter consistency.</li><li>Coat filets with batter and fry in hot oil about 3 minutes on each side or until golden brown. Set aside to a warm place.</li><li>From the remaining batter form small pancakes and fry in the same oil. They make great accompaniment to the fillets.</li><li>Serve immediately with potato salad.</li></ol>",
    "ingredients": [
      "6 bay leaves",
      "1 tablespoon black peppercorn",
      "1/2 teaspoon cardamom",
      "1 pinch of cinnamon, allspice and ginger",
      "100 grams corn flour",
      "1 tablespoon flour",
      "4 cloves garlic",
      "1/4 teaspoon ground nutmeg",
      "1/2 teaspoon ground sweet paprika",
      "1/2 teaspoon ground pepper",
      "300 milliliters light beer",
      "1/2 cup peanut oil",
      "500 grams perch fillets (fresh or frozen and thawed)",
      "1/2 tablespoon sea salt",
      "1 tablespoon seasoning mix (or Old Bay seasoning)"
    ]
  },
  {
    "title": "3 Cheese Ravioli",
    "source_url": "https://www.foodista.com/recipe/Z6KMZCDD/ravioli",
    "ready_in_minutes": 45,
    "servings": 6,
    "image": "https://img.spoonacular.com/recipes/631863-556x370.jpg",
    "instructions": "<ol><li>In a large bowl, mix the first four ingredients together (flour, egg, salt and oil). Form a ball of dough using your hands, then let it rest for about 1 hour.</li><li>In another bowl, mix together: ricotta, Gruyere and Parmesan cheese, eggs, parsley - then season with nutmeg, salt and pepper. Divide the dough into 2 equal parts. Roll them out (using a rolling pin) to very make a large, thin rectangle.</li><li>Place tablespoons of filling on the sheet of dough about 1 inch apart until all the filling and dough have been used up. Using a pizza cutter, cut the ravioli in squares.</li><li>Boil the chicken stock or water in a large pot, then add the ravioli and let it boil in the stock for about 3-5 minutes, until cooked.</li><li>Remove and drain the ravioli, then sprinkle melted butter and Parmesan cheese. Toss and serve hot.</li></ol>",
    "ingredients": [
      "2 tablespoons butter, melted",
      "¼ Cup chicken stock",
      "3 teaspoons cooking oil",
      "2 large eggs, beaten",
      "2/3 pound flour",
      "ground nutmeg",
      "1/4 pound Gruyere cheese, grated",
      "2 tablespoons Parmesan cheese, grated",
      "2 tablespoons parsley, chopped",
      "pound Ricotta cheese",
      "teaspoon salt",
      "salt and pepper"
    ]
  },
  {
    "title": "Cuban Flank Steak With Avocado and Tomato Salad",
    "source_url": "https://www.foodista.com/recipe/LK3QZ85C/cuban-flank-steak-with-avocado-and-tomato-salad",
    "ready_in_minutes": 45,
    "servings": 1,
    "image": "https://img.spoonacular.com/recipes/640990-556x370.jpg",
    "instructions": "Place all of the Mojo Sauce ingredients in a small food processor, or blender.  I have a Bullet which I love and is perfect for making the mojo sauce.\nPlace the flank steak in a zip lock bag or shallow dish.  Add the sauce; l let marinate in refrigerator for 2 hour to overnight.\nRemove the flank steak from the marinade; place remaining marinade in saucepan.  Let steak stand at room temperature for 30 minutes.\nGrill the flank steak to your desired doneness.  As you can see from the picture, we like ours on the rare side.  Let the cooked steak stand for 10 minutes before thinly slicing across the grain.\nBring the marinade in the saucepan to a boil.  Let it cook for several minutes; it will begin to thicken.\nPlace the avocado, tomato and onion into a bowl.  Add the heated mojo sauce to the salad.  Serve on the side of the steak, or on top.  Your preference.",
    "ingredients": [
      "cup ¼ olive oil",
      "cup ¼ fresh lime juice",
      "2 tbs orange juice",
      "4 garlic cloves",
      "2 tbs water",
      "teaspoon ½ cumin",
      "teaspoon ½ salt",
      "teaspoon ½ black pepper",
      "teaspoon ½ dried oregano",
      "Hand full of fresh cilantro",
      "1 flank steak",
      "1 avocado, chopped",
      "1 tomato, chopped",
      "4 tbs finely chopped red onion"
    ]
  },
  {
    "title": "Pasta With Chicken and Mushrooms",
    "source_url": "https://www.foodista.com/recipe/6QZ47BPL/pasta-with-chicken-and-mushrooms",
    "ready_in_minutes": 45,
    "servings": 6,
    "image": "https://img.spoonacular.com/recipes/654913-556x370.jpg",
    "instructions": "<ol><li>Bring 6 quarts of salted water to a rolling boil in a large pot. Season the flour with salt and pepper. Dredge the chicken in the seasoned flour.</li><li>Shake off any excess. Heat the oil in a large, heavy non-stick skillet over high heat. Brown the chicken on one side (about 3 minutes). Add the garlic. Turn the chicken. Scatter the mushrooms over the chicken. Cook for 3 minutes, shaking the skillet to distribute the mushrooms. Add the vinegar, broth, bay leaves, and thyme. Cover the skillet lightly. Cook, over medium heat for 10 minutes, turning the chicken once. Uncover.</li><li>Transfer the chicken to a warm plate. Cover with foil. Continue cooking the mushrooms for another 7 minutes. Cook the pasta, stirring frequently, in the boiling salted water until al dente.Drain. Place on a warm serving plate. Arrange the chicken pieces over the pasta. Remove the bay leaf from the sauce. Pour the mushroom sauce over the chicken and pasta. Serve.</li></ol>",
    "ingredients": [
      "1/4 cup Balsamic Vinegar",
      "1 bay leaf",
      "6 Chicken Breast Halves, skinned & boned",
      "2 cups chicken broth",
      "1/4 cup flour",
      "1 pound Linguini, uncooked",
      "1/2 pound mushrooms, sliced",
      "2 teaspoons olive oil",
      "1/2 teaspoon pepper",
      "1/4 teaspoon salt",
      "1/4 teaspoon Thyme"
    ]
  },
  {
    "title": "Korean Beef Rice Bowl",
    "source_url": "https://www.foodista.com/recipe/7LRXNC6T/korean-beef-rice-bowl",
    "ready_in_minutes": 45,
    "servings": 4,
    "image": "https://img.spoonacular.com/recipes/649030-556x370.jpg",
    "instructions": "Rinse beef, pat dry, and cut across the grain into 1/8-inch-thick slices about 3 inches long. In a small bowl, mix beef with 1/4 cup Korean Marinade.\nRemove and discard bean stem ends and strings. Cut beans diagonally in 3-inch lengths. Cut carrot into matchstick-size pieces about 3 inches long.\nIn a 14-inch wok or 12-inch frying pan over high heat, mix 1/2 cup water, beans, and carrot. Cover and stir occasionally just until tender to bite, about 3 minutes. Drain; immerse in cold water. Drain when cool. In a bowl, mix with vinegar, sesame oil, sugar, and salt to taste.\nPlace wok over high heat; when hot, add salad oil. Add beef with liquid in bowl; stir until meat is no longer pink, about 2 minutes. Add remaining marinade and broth to pan; stir until boiling.\nScoop rice into bowls; add beef and sauce, then vegetables and seasonings. Sprinkle with onions and sesame seed.\nThis recipe yields 4 servings.\nComments: If you can't find toasted sesame seed, stir regular sesame seed in a frying pan over low heat until golden, 1 minute.",
    "ingredients": [
      "1 pound fat-trimmed beef flank steak",
      "Korean Marinade (see recipe)",
      "3/4 pound green beans rinsed",
      "1 carrot - (1/4 lb) peeled",
      "2 tablespoons rice vinegar",
      "1 tablespoon Asian (toasted) sesame oil",
      "2 teaspoons sugar",
      "Salt to taste",
      "1 tablespoon salad oil",
      "1/2 cup fat-skimmed beef broth",
      "6 cups Hot Cooked Rice (see recipe)",
      "1/4 cup thinly-sliced green onions",
      "1 tablespoon toasted sesame seed"
    ]
  },
  {
    "title": "Cilantro Lime Fish Tacos",
    "source_url": "https://www.foodista.com/recipe/Z7RHNQ7Z/cilantro-lime-fish-tacos",
    "ready_in_minutes": 45,
    "servings": 4,
    "image": "https://img.spoonacular.com/recipes/639413-556x370.jpg",
    "instructions": "<ol><li>Heat the oil in a 12-inch skillet over medium-high heat.  Add the fish and cook for 8 minutes or until it flakes easily when tested with a fork, turning over once halfway through the cooking time.</li><li>Add the concentrated broth, lime juice and cilantro to the skillet.  Break the fish into large pieces with a spoon, stirring to coat with the broth mixture.</li><li>Divide the fish mixture among the tortillas.  Top with the lettuce, onion, sour cream and salsa.  Fold the tortillas around the filling.</li></ol>",
    "ingredients": [
      "2 packets Swanson® Flavor Concentrated Seafood Broth",
      "8 flour tortillas (6-inch), crisp taco shells or fresh corn tortillas, warmed",
      "1 tablespoon chopped fresh cilantro leaves",
      "1 cup shredded lettuce or cabbage",
      "2 tablespoons lime juice",
      "olive oil",
      "2 tablespoons diced red onions",
      "1/4 cup Pace® Chunky Salsa",
      "1/4 cup sour cream",
      "1 pound fresh or thawed frozen cod or tilapia fillets"
    ]
  }
]